package com.compony;

import org.junit.jupiter.api.Test;

import static org.junit.jupiter.api.Assertions.*;

class StackTest {


    @Test
    void push() {
        // Заполнить стек 4 элементами
        // проверим что 4 элемента
        // удалить 2 элемента используя pop()
        // проверить, что осталось два элемента
    }

    @Test
    void pop() {
        // Создать стэк
        // Удалить элемент через pop() и проверить, что вернулось null
        // Проверить размерность на 0
    }

    @Test
    void peek() {
        // Заполнить стек 4 элементами
        // проверим что 4 элемента
        // Возьмем элемент через peek() и проверим что размерность не изменилась
        // проверить что 4 элемента
    }
    // Написать тест, который проверит, что в случае если push() передается null выдается нужный exception
    // Написать тест, который при передачи в push() значение null, выдаст нужный текст нашего exception

}